[
{"term":"2D","abbreviation":"","definition":"Two-dimensional","references":"PAS1192-2 Back"},
{"term":"2D Drawing","abbreviation":"","definition":"A 2D drawing contains a view of a model that is referenced into a 'drawing sheet template' (blank drawing and title block). Such drawings must always be considered to be static documents, as they are drawing renditions or snapshots of the design?s model files.  Such renditions are generated each time the drawing is prepared for 'sharing' at regular milestones","references":"PAS1192-2 Back"},
{"term":"2D Model","abbreviation":"","definition":"A model with entities having two-dimensional properties. Such models are always to be considered to be dynamic, as they will be made up of 'model files' that are 'reference' files","references":"PAS1192-2 Back"},
{"term":"3D","abbreviation":"","definition":"Three-dimensional","references":"PAS1192-2 Back"},
{"term":"3D Model","abbreviation":"","definition":"A model with objects having three-dimensional properties. Such models are always to be considered to be dynamic, as they will be made up of 'model files' that are 'reference' files","references":"PAS1192-2 Back"},
{"term":"3D Visualization","abbreviation":"","definition":"3D images from the 3D CAD model, or a virtual representation of the building or facility to be constructed; used for visualizing the project","references":"PAS1192-2 Back"},
{"term":"Acceptance Critieria","abbreviation":"","definition":"Evidence required for considering that requirements have been fulfilled","references":"ISO 22263"},
{"term":"Accessory","abbreviation":"","definition":"product of the same or of different product groups, which can be attached to a product. NOTE 1 to entry: An accessory is not a different type of product, it plays an ancillary role to another product.","references":"ISO/DSI 16757-1"},
{"term":"Accessory Hierarchy","abbreviation":"","definition":"Representation of the dependencies between products and accessories","references":"ISO/DSI 16757-1"},
{"term":"Activity","abbreviation":"","definition":"task that is needed to produce a deliverable","references":"BS8536-1"},
{"term":"Activity Space","abbreviation":"","definition":"Space defined by the spatial extension of an activity. NOTE 1 to entry: A spatial extension of an activity, for example, a table or a bed, and the activity space around them.","references":"ISO 12006-2"},
{"term":"Actor","abbreviation":"","definition":"A person, an organization or an organizational unit (such as a department, team, etc.) involved in a construction process","references":"ISO/DIS 29481-1"},
{"term":"Aftercare","abbreviation":"","definition":"defined period post-handover of an asset/facility in which the design and construction team passes on information and knowledge to the operator, operations team or facility manager, responds to queries and problems, and monitors and reviews the asset’s/facility’s performance.","references":"BS8536-1"},
{"term":"Alignment","abbreviation":"","definition":"Achieving complete agreement between the contents of an information model and the state of a physical asset","references":"OBE"},
{"term":"Archive","abbreviation":"","definition":"Component of the common data environment.  NOTE: The archive section of the CDE is for inactive of superseded information. Such information will provide a history of the project information transfers, sharing, change orders and knowledge retention, and can be used for other contractual purposes or 'discovery'","references":"BS1192, PAS1192-2 Back"},
{"term":"Area of Capability","abbreviation":"","definition":"Prequalification topic that enquires about the capability of suppliers and their supply chains ? as defined by the relevant question module e.g. health and safety","references":"PAS 91"},
{"term":"Article Number","abbreviation":"","definition":"Manufacturer's reference number, GTIN, or other identifier identifying the product or constituents of a product","references":"ISO/DSI 16757-1"},
{"term":"As-Constructed","abbreviation":"","definition":"A model consisting of documentation, non-graphical information and graphical information defining the delivered project.  'As-constructed' defines the defect and deviation to the designed model occurring during construction. The 'As-constructed' model and its appended documentation are continually updated through re-measurement as construction progresses. This allows for deviation to be reviewed with respect to the following packages and making knowledgeable assessment of impact and resolution","references":"PAS1192-2 Back"},
{"term":"Aspect","abbreviation":"","definition":"Concept by which the existence and appearance of a thing is experience and cannot exist without the existence of its possessor and which is either an intrinsic non-separable facet of its possessor or a role of its possessor","references":"ISO 16354"},
{"term":"Aspect (Scale Relation)","abbreviation":"","definition":"Relation that specifies that aspects of the specified kind can be quantified using the kind of scale R1 role player: aspect R2 role player: scale/R1 role: quantifiable R2 role: quantifying/R1-R2 expression: can be quantified on scale R2-R1 expression:can be a scale for a","references":"ISO 16354"},
{"term":"Aspect (Unit of measure Relation)","abbreviation":"","definition":"Relation that specifies that aspects of the specified kind shall be quantified using the particular unit of measure R1 role player: aspect R2 role player: unit of measure/R1 role: quantifiable R2: quantifying/R1-R2 expression: shall be quantified on unit R2-R1 expression: shall be a unit for a","references":"ISO 16354"},
{"term":"Assembly","abbreviation":"","definition":"Group of components or types to enable the reuse of standardized design or specification elements improving productivity of design and delivery as well as providing a location to hold specifications and lessons learnt in a simple and useable way. The contents of assemblies may themselves have attributes and classifications.","references":"PAS1192-2 Back, BS1192-4"},
{"term":"Assessment Provider","abbreviation":"","definition":"Entity undertaking prequalification of suppliers as a service to both buyers and suppliers","references":"PAS 91"},
{"term":"Asset","abbreviation":"","definition":"item, thing or entity that has potential or actual value to an organization","references":"PAS1192-3, BS1192-4, PAS1192-5, ISO 55000, BS8536-1"},
{"term":"Asset Information","abbreviation":"","definition":"Data or information relating to the specification, design, construction or acquisition, operation and maintenance, and disposal or decommissioning of an item, thing or entity that has potential or actual value to an organization","references":"PAS1192-5"},
{"term":"Asset Information Management","abbreviation":"","definition":"Discipline of managing asset-related organizational data and information to a sufficient quality to support organizational objectives and outcomes","references":"PAS1192-3"},
{"term":"Asset Information Model","abbreviation":"AIM","definition":"Maintained information model used to manage, maintain and operate the asset; required to support an organization?s asset management system","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-3"},
{"term":"Asset Information Requirements","abbreviation":"AIR","definition":"Data and information requirements of the organization in relation to the asset(s) it is responsible for","references":"PAS1192-3"},
{"term":"Asset Management","abbreviation":"","definition":"Coordinated activity of an organization to realize value from assets","references":"PAS1192-3, PAS1192-5, ISO 55000, BS8536-1"},
{"term":"Asset Management System","abbreviation":"","definition":"Management system for asset management whose function is to establish the asset management policy and asset management objective","references":"PAS1192-3"},
{"term":"Asset Owner","abbreviation":"","definition":"Individual or organization that owns the built asset and any associated asset information, is the asset operator or licensee, or is the operator of the system of which the built asset is a component","references":"PAS1192-5"},
{"term":"Attribute","abbreviation":"","definition":"piece of data forming a partial description of an object or entity","references":"PAS1192-2 Front, PAS1192-2 Back, BS1192-4"},
{"term":"Auditor","abbreviation":"","definition":"Testing review body","references":"BS 8541-6"},
{"term":"Author","abbreviation":"","definition":"originator of Information Model; Graphical Model, Non Graphical Information and Documents.","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Baseline Security Measures","abbreviation":"","definition":"Contractually required measures relating to personal and commercial information","references":"PAS1192-5"},
{"term":"Basis for Design","abbreviation":"","definition":"information and data concerning the required function, form, layout, specification and operation of an asset/facility amongst other matters","references":"BS8536-1"},
{"term":"BIM Guidance Document","abbreviation":"","definition":"Document that aids users in achieving their intended results through the use of BIM","references":"ISO 12911"},
{"term":"BIM Software Application","abbreviation":"","definition":"A software application that is used to create, modify, analyze, manage, publish, share, or expire eleements of a BIM","references":"ISO/DIS 29481-1"},
{"term":"BIM Viewer","abbreviation":"","definition":"Software used to view 3D rendition without requiring the user to have the software that produced the model (Navisworks, Navigator, Solibris, etc.; also eDrawing to view both 2D and 3D rendition)","references":"PAS1192-2 Back"},
{"term":"Binary Relation","abbreviation":"","definition":"Relation that specifies a relationship between two things, each of which is playing its own role that is of a kind that is typical for the relation type","references":"ISO 16354"},
{"term":"Boolean Operators","abbreviation":"","definition":"Logical operators such as conjunction ? (and) disjunction ? (or), and negation ? (not) used in solid modelling to combine primitive solids","references":"ISO/DSI 16757-2"},
{"term":"Brief","abbreviation":"","definition":"working document which specifies at any point in time the relevant needs and aims, resources of the client and user, the context of the project and any appropriate design requirements within which all subsequent briefing (when needed) and designing can take place","references":"BS8636-1"},
{"term":"Briefing","abbreviation":"","definition":"process of identifying and analysing the needs, aims and constraints (the resources and the context) of the client and the relevant parties, and of formulating any resulting problems that the designer is required to solve","references":"BS8536-1, BS7832, ISO9699"},
{"term":"BSS Property","abbreviation":"","definition":"Technical property that describes an aspect of the current state of a BSS","references":"ISO/DSI 16757-1"},
{"term":"Building Information Management","abbreviation":"BIM(M)","definition":"Sometimes Building Information Management but as BIM(M) Building Information and Management","references":"PAS1192-2 Back"},
{"term":"Building Information Model","abbreviation":"BIM","definition":"Shared digital representation of physical and functional characteristics of any built object, including buildings, bridges, roads, process plant","references":"ISO 12911"},
{"term":"Building Information Modelling","abbreviation":"BIM","definition":"process of designing, constructing or operating a building or infrastructure asset using electronic object-oriented information","references":"ISO 12911, ISO/DSI 16757-1, ISO/DIS 29481-1,  PAS1192-2 Front, PAS1192-2 Back, PAS1192-5, BS8636-1"},
{"term":"Building Information Modelling Execution Plan","abbreviation":"BEP","definition":"Plan prepared by the suppliers to explain how the information modelling aspects of a project will be carried out","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Building Services","abbreviation":"","definition":"Utilities and installations supplied and distributed within a building such as electricity, gas, heating, water, and communications","references":"ISO/DSI 16757-1"},
{"term":"Building Services System","abbreviation":"BSS","definition":"Technical system that provides building services in a building","references":"ISO/DSI 16757-1"},
{"term":"Built Asset","abbreviation":"","definition":"Building, multiple buildings (e.g. a site or campus) or built infrastructure (e.g. roads, railways, pipelines, dams, docks, etc.) that is the subject of a construction project or where the asset information is held in a digital format","references":"PAS1192-5"},
{"term":"Built Asset Security Information Requirements","abbreviation":"BASIR","definition":"The BASIR shall detail the employer or asset owner?s requirements with regard to the arrangements for, and overseeing of, the secure capture, handling, dissemination, storage, access and use of all data and information pertaining to sensitive assets and systems","references":"PAS1192-5"},
{"term":"Built Asset Security Manager","abbreviation":"","definition":"Individual reporting directly to, or employed by, the employer or asset owner and undertaking the role of security management","references":"PAS1192-5"},
{"term":"Built Environment","abbreviation":"","definition":"Physical construction result intended to serve a function or user activity","references":"ISO 12006-2"},
{"term":"Built Space","abbreviation":"","definition":"Space defined by built or natural environment or both, intended for user activity or equipment","references":"ISO 12006-2"},
{"term":"Business Requirement","abbreviation":"","definition":"A requirement that describes in business terms what needs to be delivered or accomplished","references":"ISO/DIS 29481-1"},
{"term":"Buyer","abbreviation":"","definition":"Client or other entity procuring the services of supplier(s) contributing to the fulfilment of a construction related contract","references":"PAS 91"},
{"term":"CAD Standard","abbreviation":"","definition":"Standard used to produce CAD models that will include origins, units, layering conventions, line specifications, file-naming conventions, drawing numbering, etc","references":"PAS1192-2 Back"},
{"term":"CAD Viewer","abbreviation":"","definition":"Software used to view rendition print fi les without requiring the user to have the software that produced the model. (Adobe PDF, DWF, etc.)","references":"PAS1192-2 Back"},
{"term":"Captial/delivery Phase","abbreviation":"","definition":"Major works where information is managed using PAS 1192-2:2013 and an asset is designed, procured and delivered","references":"PAS1192-3"},
{"term":"Catalogue Metadata","abbreviation":"","definition":"Data in the catalogue which contains data about the catalogue itself","references":"ISO/DSI 16757-1"},
{"term":"CDM Coordinator","abbreviation":"","definition":"employee whose role is to 'advise and assist the client to comply with their duties under the Construction (Design and Management)] Regulations'","references":"BS7000-4"},
{"term":"CIC Scope of Services","abbreviation":"","definition":"Multi-disciplinary scope of services published by the Construction Industry Council (CIC) for use by members of the project team on major projects","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Clash Rendition","abbreviation":"CR","definition":"Rendition of the native format model file to be used specifically for spatial coordination processes. To achieve clash avoidance or to be used for clash detection","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Class","abbreviation":"","definition":"A type or collection of things that share common attributes","references":"ISO/DIS 29481-1"},
{"term":"Classification","abbreviation":"","definition":"Systematic arrangement of headings and sub-headings for aspects of construction work including the nature of assets, construction elements, systems and products","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Classification Relation","abbreviation":"","definition":"Relation that relates an individual thing to a kind of thing, indicating that the individual thing is of a specified kind, because of the fact that the individual thing has aspects that comply with the definition of the kind R1 role player: an individual thing R2 role player: concept/R1 role: classified R2 role: classifier/R1-R2 expression: is classified as a R2-R1 expression: is a classifier of","references":"ISO 16354"},
{"term":"Clause","abbreviation":"","definition":"Subsection of a guidance document which contains an objective and one or more definitions and requirements","references":"ISO 12911"},
{"term":"Client","abbreviation":"","definition":"Individual or organization commissioning a built asset","references":"PAS1192-2 Front, PAS1192-2 Back, PAS 91"},
{"term":"Clipping","abbreviation":"","definition":"Operation applied to a geometric model to remove parts of the model beyond a defined boundary","references":"ISO/DSI 16757-2"},
{"term":"Code","abbreviation":"","definition":"Sequence of characters, often a mnemonic, having defined meaning when interpreted in the context of the field in which it is entered, used to concisely convey meta-data","references":"BS1192"},
{"term":"Collection","abbreviation":"","definition":"Concept that indicates a plurality, consisting of a number of things without a particular structure between the elements and not necessarily with a common discriminator","references":"ISO 16354"},
{"term":"Collection of Concepts Relation","abbreviation":"","definition":"Relation that specifies that a concept is an element of a collection of concepts R1 role player: concept R2 role player: collection/R1 role: collected R2 role: collector/R1-R2 expression: is an element in collection of concepts R2-R1 expression: is a collection of concepts including","references":"ISO 16354"},
{"term":"Commissioning","abbreviation":"","definition":"process by which equipment, a system, a facility or a plant that is installed, is completed or near completion is tested to verify if it functions according to its design specification and intended application","references":"BS8636-1, ISO 50004"},
{"term":"Common Arrangement of Work Sections","abbreviation":"CAWS","definition":"Common Arrangement of Work Sections, published by CPIC for use in specifications and bills of quantities","references":"PAS1192-2 Back"},
{"term":"Common Data Environment","abbreviation":"CDE","definition":"Single source of information for any given project, used to collect, manage and disseminate all relevant approved project documents for multi-disciplinary teams in a managed process","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-3, PAS1192-5, BS8636-1"},
{"term":"Component","abbreviation":"","definition":"named and individually scheduled physical items and features that might require management, such as inspection, maintenance, servicing or replacement, during the in-use phase","references":"PAS1192-2 Back, BS1192-4"},
{"term":"Composition Relation","abbreviation":"","definition":"Relation between two kinds of things that specifies that something that is classified by a concept that plays the role of whole can have one or more components that are classified by another concept that plays the role of part, in which the number of parts may be constrained by cardinality constraints R1 role player: concept R2 role player: concept/ R1 role: part R2 role: whole/R1-R2 expression: can be a part of a R2-R1 expression: can be a whole for a","references":"ISO 16354"},
{"term":"Computer Aided Design","abbreviation":"CAD","definition":"","references":""},
{"term":"Computer Aided Design and Draughting","abbreviation":"CADD","definition":"","references":""},
{"term":"Computer-aided Facility Management","abbreviation":"CAFM","definition":"","references":""},
{"term":"Concept","abbreviation":"","definition":"(1) unit of knowledge created by a unique combination of aspects and/or components (adapted from ISO 1087-1) (2) commonality between individual things that is defined by one or more constraints that describe the limits for the inclusion of individual things to conform to the concept","references":"ISO 16354"},
{"term":"Concession","abbreviation":"","definition":"Permission to use or release a product that does not conform to specific requirements or a concession against a contract requirement (gain permission for non-conformance)","references":"PAS1192-2 Back"},
{"term":"Concurrent Engineering","abbreviation":"","definition":"Systematic approach to the integrated, concurrent design of products and their related processes, including manufacture and support (based on IDA definition). In a construction context it incorporates, both early contractor and owner/operator involvement","references":"PAS1192-2 Back"},
{"term":"Conenvtional Cartesian Axis","abbreviation":"","definition":"Geometric convention using positive co-ordinates (X, Y, Z) ordered as (East, North, upwards), so that conventional plans use X, Y; and Z is upwards","references":"BS1192"},
{"term":"Configuration","abbreviation":"","definition":"Interrelated functional and physical characteristics of a product defined in product configuration information","references":"PAS1192-2 Back"},
{"term":"Configuration Item","abbreviation":"","definition":"Entity within a configuration that satisfies an end use function","references":"PAS1192-2 Back"},
{"term":"Configuration Management","abbreviation":"","definition":"Co-ordinated activities to direct and control configuration","references":"PAS1192-2 Front"},
{"term":"Confirguration Status Accounting","abbreviation":"","definition":"Formalized recording and reporting of product configuration information, the status of proposed changes and the status of the implementation of approved changes","references":"PAS1192-2 Back"},
{"term":"Conformity","abbreviation":"","definition":"Fulfilment of a requirement","references":"ISO 22263"},
{"term":"Connection","abbreviation":"","definition":"Named logical relationship between two Components","references":"BS1192-4"},
{"term":"Consortium","abbreviation":"","definition":"Association of two or more entities (individuals, companies or organizations) pooling resources to participate in a common construction related project","references":"PAS 91"},
{"term":"Constraint","abbreviation":"","definition":"Relationship between two or more elements in a model, which should be maintained in any modifications made subsequent to a model transfer","references":"ISO 12911"},
{"term":"Constructed Facility","abbreviation":"","definition":"A unit of the built environment with a characteristic spatial form, intended to serve some function or support a user activity","references":"ISO/DIS 29481-1"},
{"term":"Construction","abbreviation":"","definition":"Building, civil engineering or other structural engineering work","references":"PAS 91"},
{"term":"Construction (Design and Management) regulations","abbreviation":"CDM","definition":"Construction (Design and Management) regulations","references":"PAS1192-2 Back"},
{"term":"Construction Activity","abbreviation":"","definition":"Component process of construction process","references":"ISO 12006-2"},
{"term":"Construction Agent","abbreviation":"","definition":"Human construction resource carrying out a construction process","references":"ISO 12006-2"},
{"term":"Construction Aid","abbreviation":"","definition":"Construction resource intended to assist in carrying out a construction process","references":"ISO 12006-2"},
{"term":"Construction Complex","abbreviation":"","definition":"Aggregate of one or more construction entities intended to serve at least one function or user activity","references":"ISO 12006-2"},
{"term":"Construction Element","abbreviation":"","definition":"Constituent of a construction entity with a characteristic function, form, or position","references":"ISO 12006-2"},
{"term":"Construction Entity","abbreviation":"","definition":"Independent unit of the built environment with a characteristic form and spatial structure, intended to serve at least one function or user activity","references":"ISO 12006-2"},
{"term":"Construction Indexing System for Construction Products","abbreviation":"CI/SfB","definition":"The UK version of the Construction Indexing Classification System for Construction products and elements ? a version of the SfB classification system originating from Sweden","references":"PAS1192-2 Back"},
{"term":"Construction Information","abbreviation":"","definition":"Information of interest in a construction process","references":"ISO 12006-2"},
{"term":"Construction Object","abbreviation":"","definition":"Object of interest in the context of a construction process","references":"ISO 12006-2"},
{"term":"Construction Operation Building information exchange","abbreviation":"COBie","definition":"Subset of BS ISO 16739 IFC documented as a buildingSMART model view definition (MVD) which includes operational information used to supply data to the organization to populate decision-making tools and asset management systems","references":"ISO 15686-4, PAS1192-2 Front, PAS1192-Back, PAS1192-3, BS1192-4"},
{"term":"Construction Organization","abbreviation":"","definition":"Group of individuals acting together in a structured, coordinated manner to achieve a common construction objective","references":"PAS 91"},
{"term":"Construction Process","abbreviation":"","definition":"Process which uses construction resources to achieve construction results","references":"ISO 12006-2, ISO/DIS 29481-1"},
{"term":"Construction Process Lifecycle","abbreviation":"","definition":"Sequence of stages from the start to the end of the construction process","references":"ISO 12006-2"},
{"term":"Construction Product","abbreviation":"","definition":"Product intended to be used as a construction resource","references":"ISO 12006-2"},
{"term":"Construction Property","abbreviation":"","definition":"Property of a construction object","references":"ISO 12006-2"},
{"term":"Construction Resource","abbreviation":"","definition":"Construction object used in a construction process to achieve a construction result","references":"ISO 12006-2"},
{"term":"Construction Result","abbreviation":"","definition":"Construction object which is formed or changed in state as the result of one or more construction processes using one or more construction resources","references":"ISO 12006-2"},
{"term":"Construction Result Lifecycle","abbreviation":"","definition":"Period of time from inception to the demolition of a construction result","references":"ISO 12006-2"},
{"term":"Construction System","abbreviation":"","definition":"Interacting construction objects organized to achieve one or more stated purposes","references":"ISO 12006-2"},
{"term":"Constructive Solid Geometry","abbreviation":"CSG","definition":"Constructive solid geometry representation. A CSG object is composed from standard primitives using regularised Boolean operations and rigid motions","references":"PAS1192-2"},
{"term":"Consultant","abbreviation":"","definition":"Entity providing expert advice or other services in relation to a construction project e.g. a designer","references":"PAS 91"},
{"term":"Contact","abbreviation":"","definition":"Named person and/or organization involved in the Facility lifecycle","references":"BS1192-4"},
{"term":"Container","abbreviation":"","definition":"Named persistent set of data within a file system or application data storage hierarchy including, but not limited to, directory, sub-directory, data file, or distinct sub-set of a data file, such as a chapter or section, layers or symbol","references":"BS1192"},
{"term":"Contractor","abbreviation":"","definition":"Entity undertaking physical construction related activity at one or more construction sites in accordance with a formal arrangement made in advance","references":"PAS 91"},
{"term":"Convention","abbreviation":"","definition":"Accepted way of drawing an item which may have the nature of a representation, a simplified representation or a symbol","references":"BS 8541-2"},
{"term":"Coordinate (position)","abbreviation":"","definition":"Named position associated to Facility, Floor (region), Space (location), Component or Assembly","references":"BS1192-4"},
{"term":"Coordinate (process)","abbreviation":"","definition":"achieving complete agreement between the contents of an information model and the state of a physical asset","references":"PAS1192-3"},
{"term":"Cyber Hygiene","abbreviation":"","definition":"conditions and practices that serve to promote or preserve cyber safety and security by individual system users","references":"PAS1192-5"},
{"term":"Cyber-physical Systems","abbreviation":"CPS","definition":"system designed as an entity, or set of entities, with a specific purpose, or to meet a capability objective","references":"PAS1192-5"},
{"term":"Data","abbreviation":"","definition":"Information stored but not yet interpreted or analyzed","references":"PAS1192-2 Front, PAS1192-3"},
{"term":"Data Manager","abbreviation":"","definition":"organizational representative responsible for establishing governance and assuring data and information flow to and from the AIM ","references":"PAS1192-3"},
{"term":"Data Store","abbreviation":"","definition":"repository for data within the AIM","references":"PAS1192-3"},
{"term":"Declaration Scheme","abbreviation":"","definition":"set of requirements for characterizing product or facility performance, prepared by an independent body other than the product manufacturer or supplier, and other than the purchaser or owner","references":"BS 8541-6"},
{"term":"Declarer","abbreviation":"","definition":"provider of the declaration, typically the manufacturer or supplier, but can be a library or scheme provider","references":"BS 8541-6"},
{"term":"Definition","abbreviation":"","definition":"Representation of a concept by a descriptive statement which serves to differentiate it from related concepts","references":"ISO 15686-4"},
{"term":"Definition Relation","abbreviation":"","definition":"Relation that specifies that a textual description is a description of something R1 role player: character string R2 role player: anything/R1 role: description R2 role: described/R1-R2 expression: is a description of R2-R1 expression: is described as","references":"ISO 15686-4"},
{"term":"Deliverable","abbreviation":"","definition":"product or service as an outcome of a process","references":"BS8536-1"},
{"term":"Descriptive Object","abbreviation":"","definition":"Object giving descriptive and/or visual information about the product","references":"ISO 15686-4"},
{"term":"Design (File Format)","abbreviation":"DGN","definition":"File extension for Bentley Systems? MicroStation and Intergraph?s Interactive Graphics Design System CAD programs.","references":"PAS1192-2 Back"},
{"term":"Design Intent Model","abbreviation":"","definition":"Initial version of the Project Information Model developed by the design suppliers","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Design Process","abbreviation":"","definition":"Construction process determining construction properties for the built environment before it is made physical","references":"ISO 12006-2"},
{"term":"Design Review Protocol","abbreviation":"","definition":"procedure for ensuring a structured and systematic review of a design at defined points in the project life cycle","references":"BS8536-1"},
{"term":"Design Team","abbreviation":"","definition":"Sub-set of the project delivery team and/or task team that is involved in the delivery of the brief, concept, definition and design stages of the project","references":"PAS1192-5"},
{"term":"Design Web Format","abbreviation":"DWF","definition":"Design web format. An open, secure file format developed by Autodesk for the distribution and communication of design data to view, review, or print design files","references":"PAS1192-2 Back"},
{"term":"Digital Plan of Works","abbreviation":"dPoW","definition":"Generic schedule of phases, roles, responsibilities, assets and attributes, made available in a computable form","references":"BS1192-4, BS8636-1"},
{"term":"Dispositioning Authority","abbreviation":"","definition":"Person or a group of persons assigned responsibility and authority to make decisions on the configuration","references":"PAS1192-2 Back"},
{"term":"Document","abbreviation":"","definition":"Container for persistent information that can be managed and interchanged as a unit","references":"PAS1192-2 Front, PAS1192-2 Back, BS1192-4"},
{"term":"Document Exchange Format (File Format)","abbreviation":"DXF","definition":"File format used mainly for importing and exporting CAD data between AutoCAD and other CAD-related programs","references":"PAS1192-2 Back"},
{"term":"Document Management System","abbreviation":"DMS","definition":"Document management system","references":"PAS1192-2 Back"},
{"term":"Document Repository","abbreviation":"","definition":"Entity including an electronic data management (EDM) system, project extranet or folder hierarchy on a Windows file server","references":"PAS1192-2 Back"},
{"term":"Drawing","abbreviation":"","definition":"Document used to present graphic information","references":"BS1192, PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Drawing (File Format)","abbreviation":"DWG","definition":"Proprietary AutoCAD file format","references":"PAS1192-2 Back"},
{"term":"Drawing Title Block","abbreviation":"","definition":"Framework ? often containing the project team?s logos ? to show the drawing title, number, purpose of issue status and revision information","references":"PAS1192-2 Back"},
{"term":"Dynamic Property","abbreviation":"","definition":"Technical property, that reflects the product's behaviour under the operating conditions of the building services system in which the product is installed","references":"ISO/DSI 16757-1"},
{"term":"Earned Value Analysis","abbreviation":"EVA","definition":"A method of project performance measurement that integrates cost, time and scope","references":"PAS1192-2 Back"},
{"term":"Electronic Document Management System","abbreviation":"EDMS","definition":"System for storing, retrieving, sharing and otherwise managing electronic documents","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Employer","abbreviation":"","definition":"Individual or organization for whom the contract is executed and delivered","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-3, PAS1192-5"},
{"term":"Employer's Information Requirements","abbreviation":"EIR","definition":"A document setting out the information requirements to be delivered, and the standards and processes to be adopted by the supplier as part of the project delivery process","references":"PAS1192-2 Front, PAS1192-2 Back, BS1192-4, BS8636-1"},
{"term":"End-user","abbreviation":"","definition":"person receiving asset/facility-related services","references":"BS8636-1"},
{"term":"Enterprise","abbreviation":"","definition":"Entity constituting multiple organizations within the supply chain","references":"PAS1192-5"},
{"term":"Entity","abbreviation":"","definition":"Synonym for 'object'","references":"PAS1192-2 Back"},
{"term":"Exchange Requirement","abbreviation":"ER","definition":"A defined set of information units that need to be exchanged to support a particular business requirement at a particular process phase (or phases) / stage (or stages)","references":"ISO/DIS 29481-1"},
{"term":"Faciility-realted service","abbreviation":"","definition":"support provision to the primary processes and activities of an organization, delivered by an internal or external provider","references":"BS8636-1"},
{"term":"Facilities Management","abbreviation":"FM","definition":"integration of processes within an organization to maintain and develop the agreed services that support and improve the effectiveness of its primary processes and activities","references":"BS8636-1"},
{"term":"Facility","abbreviation":"","definition":"Named distinct operational built or geographic asset, typically a building or section of infrastructure along with details and extent of the geographic site and of the temporal project","references":"ISO 12911, BS1192-4"},
{"term":"Facility Declaration","abbreviation":"","definition":"Data associated to a facility such as a constructed asset, building or structure, provided or verified by a distinct independent declaration scheme to support evaluation and comparisons","references":"BS 8541-6"},
{"term":"Facility Handbook","abbreviation":"","definition":"organized collection of documentation covering the operation of an asset/facility","references":"BS8636-1"},
{"term":"Facility Management","abbreviation":"","definition":"All the services before, during, and after utilisation of real estate properties and infrastructure based on a holistic (integral) strategy","references":"ISO/DSI 16757-1"},
{"term":"Fact","abbreviation":"","definition":"State of being the case","references":"ISO 16354"},
{"term":"Field","abbreviation":"","definition":"Part of a container name reserved for meta-data","references":"BS1192"},
{"term":"File Store","abbreviation":"","definition":"Repository for information within the asset information model","references":"PAS1192-3"},
{"term":"Floor (Region)","abbreviation":"","definition":"Named intermediate spatial subdivision, including distinct vertical levels and horizontal areas and sections with Spaces allocated","references":"BS1192-4"},
{"term":"Formula","abbreviation":"","definition":"Algorithms and formulas for the calculation of computable product properties","references":"ISO/DSI 16757-1"},
{"term":"Framework","abbreviation":"","definition":"Structure of processes and specifications designed to support the accomplishment of a specific task","references":"ISO 12911"},
{"term":"Function","abbreviation":"","definition":"Algorithms and formulas for the calculation of computable product properties","references":"ISO/DSI 16757-1"},
{"term":"Gate","abbreviation":"","definition":"Division of a standardized process map for the acquisition of a facility, at some of which the requirements can be delivered","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Generic Object","abbreviation":"","definition":"type object intended for use in stages of design when the object is not resolved into a product","references":"BS 8541-1, BS 8541-3, BS 8541-4"},
{"term":"Global Trade Item Number","abbreviation":"GTIN","definition":"Identifier for trade items used to look up product information in a database GS1","references":"ISO/DSI 16757-1"},
{"term":"Globally Unique Identifier","abbreviation":"GUID","definition":"Identifier given to a product that guarantees its uniqueness throughout its entire life","references":"ISO 15686-4"},
{"term":"Graphical Data","abbreviation":"","definition":"Data conveyed using shape and arrangement in space","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Graphical File","abbreviation":"","definition":"File format designed specifically for representing graphical images","references":"PAS1192-2 Back"},
{"term":"Handover","abbreviation":"","definition":"The stage of a capital/delivery project where the asset is made available for use or occupation","references":"PAS 1192-3"},
{"term":"Hostile Reconnaissance","abbreviation":"","definition":"Activity of acquiring information about a target with the view to planning to attack, compromise, disrupt or destroy that target","references":""},
{"term":"IDM Compontents","abbreviation":"","definition":"The basic elements that form an IDM: interaction maps / transaction maps, process maps and exchange requirements","references":"ISO/DIS 29481-1"},
{"term":"Impact","abbreviation":"","definition":"Representation of an economic, environmental or social dis-benefit of a product","references":"ISO 15686-4, BS1192-4"},
{"term":"Individual Thing","abbreviation":"","definition":"Concept that classifies any real world or imaginary thing that has individuality that is not dependent on a commonality between things","references":"ISO 16354"},
{"term":"Information","abbreviation":"","definition":"representation of data in a formal manner suitable for communication, interpretation or processing by human beings or computer applications","references":"ISO 22263, PAS1192-2 Front, PAS1192-2 Back, PAS1192-3"},
{"term":"Information Constraint","abbreviation":"","definition":"A statement that formally defines or constrains the scope of a piece of information due to some aspect of the business, a rule under which an organization operates or a policy or decision that influences a process","references":"ISO/DIS 29481-1"},
{"term":"Information Delivery Manual","abbreviation":"IDM","definition":"Strategy for identifying the processes, exchange requirements, business rules and functional parts for information exchanges in facility projects","references":"ISO 12911, ISO/DIS 29481-2"},
{"term":"Information Device","abbreviation":"","definition":"Convention indicating an abstract item","references":"BS 8541-2"},
{"term":"Information Exchange","abbreviation":"","definition":"Structured collection of information at one of a number of pre-defined stages of a project with defined format and fidelity","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Information Management","abbreviation":"","definition":"Policies, processes, and tasks applied to inputting, processing and generation activities to ensure accuracy, authenticity, confidentiality and integrity of information","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-5"},
{"term":"Information Management Process","abbreviation":"IMP","definition":"Process to manage information related to the operational phase of an asset","references":"PAS1192-3"},
{"term":"Information Manager","abbreviation":"","definition":"Organizational representative appointed by the employer or asset owner, who is responsible for establishing governance and assuring data and information flow to and from the common data environment (CDE) during the design, construction, operation and maintenance, and disposal or decommissioning of a built asset","references":"PAS1192-5"},
{"term":"Information Model","abbreviation":"","definition":"The information model comprises three constituent parts:  graphical information, non-graphical information and documentation,","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Information Modelling","abbreviation":"","definition":"Use of data to provide information through better understanding, by applying logic or mathematical functions to derive new data","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Information Unit","abbreviation":"","definition":"An individual information item such as a window identifier or a room depth","references":"ISO/DIS 29481-1"},
{"term":"Instance","abbreviation":"","definition":"Occurrence of an entity at a particular location and orientation within a model","references":"BS1192"},
{"term":"Interaction Framework","abbreviation":"","definition":"Formal description of the elements of interaction, including definition of roles, transactions, messages in transactions, and data elements in messages","references":"ISO/DIS 29481-1, ISO/DIS 29481-2"},
{"term":"Interaction Framework Schema","abbreviation":"","definition":"Formal description of the rules with which sent and received messages must comply","references":"ISO/DIS 29481-2"},
{"term":"International Alliance for Interoperability","abbreviation":"IAI","definition":"International Alliance for Interoperability.  Now known as buildingSMART","references":"PAS1192-2 Back"},
{"term":"Intrinsic Aspect","abbreviation":"","definition":"Role that an aspect plays in a relationship and that is dependent on the aspect as well as on the possessing object","references":"ISO 16354"},
{"term":"Involvement Relation","abbreviation":"","definition":"Relation between kinds of things that specifies that physical objects of a kind can play a role in an occurrence of a kind R1 role player: physical object R2 role player: occurrence/R1 role: involved R2: involver/R1-R2 expression: can be involved in R2-R1 expression: can involve a","references":"ISO 16354"},
{"term":"Issue","abbreviation":"","definition":"Named deficiency in the information or risk associated to the assets","references":"BS1192-4"},
{"term":"Job","abbreviation":"","definition":"Named task or activity during the in-use phase associated to Types","references":"BS1192-4"},
{"term":"Key Performance Indicator","abbreviation":"KPI","definition":"measure that provides essential information about the performance of asset/facility-related services delivery","references":"BS8636-1"},
{"term":"Knowledge Library","abbreviation":"","definition":"Collection of information models that express knowledge (which may include also definition models and requirements model(s) about kinds of things (concepts) and that are stored and retrieved as electronic information","references":"ISO 16354"},
{"term":"Knowledge Model","abbreviation":"","definition":"Information model that expresses knowledge in a computer interpretable structure","references":"ISO 16354"},
{"term":"Language","abbreviation":"","definition":"Coding system of spoken and/or written words and sentences (expressions and phrases) that is used to commuicate between people or systems","references":"ISO 16354"},
{"term":"Layer","abbreviation":"","definition":"Property given to entities within CAD files enabling their visibility and graphical representation to be controlled. Further values may be assigned to the attribute to enable control whether it can be edited or deleted","references":"BS1192, PAS1192-2 Back"},
{"term":"Lean","abbreviation":"","definition":"Production focused on delivering value for the employer and eliminating all non-value-adding activities using an efficient workflow","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Lean Pinciples","abbreviation":"","definition":"Understanding value from a client?s perspective identifying the value stream, establish a balanced flow of work, in which the demand for product is pulled from the next customer, with a constant drive for continuous improvement and perfection (Based on 'Lean Thinking', Womack & Jones, 2003 edition)","references":"PAS1192-2 Back"},
{"term":"Level of Attributing","abbreviation":"","definition":"Categorization based on a minimum content of attributing information on a library Object","references":"BS 8541-4"},
{"term":"Level of Definition","abbreviation":"","definition":"Collective term used for and including 'level of model detail' and the 'level of information detail'","references":"PAS1192-2 Front"},
{"term":"Level of Detail","abbreviation":"","definition":"completeness and accuracy of a virtual shape representation compared to the physical and functional characteristics of the actual object","references":"BS 8541-3"},
{"term":"Level of Measurement","abbreviation":"","definition":"completeness and accuracy of a virtual measurement compared to the physical and functional characteristics of the actual object","references":"BS 8541-3"},
{"term":"Levels of Model Detail","abbreviation":"LOD","definition":"Description of graphical content of models at each of the stages defined for example in the CIC Scope of Services","references":"PAS1192-2 Back"},
{"term":"Levels of Model Information","abbreviation":"LOI","definition":"Description of non-graphical content of models at each of the stages defined for example in the CIC Scope of Services","references":"PAS1192-2 Back"},
{"term":"Life Cycle","abbreviation":"","definition":"Stages and activities spanning the life of the system from the definition of its requirements to the termination of its use, covering its conception, development, operation, maintenance support and disposal","references":"ISO 12911"},
{"term":"Maintainer","abbreviation":"","definition":"individual, department or organization engaged by either the owner or operator of an asset to carry out maintenance on or in connection with that asset","references":"PAS1192-3"},
{"term":"Maintenance","abbreviation":"","definition":"Combination of all technical and associated administrative actions to retain or restore an asset to a state in which it can perform its required function","references":"PAS1192-3"},
{"term":"Maintenance Process","abbreviation":"","definition":"Construction process preserving the function of, or operating, the built environment","references":"ISO 12911"},
{"term":"Manageable Assets","abbreviation":"","definition":"Those aspects of the facility that may be managed during the facility life-cycle include both physical and spatial objects, and their functional groupings","references":"PAS1192-2 Back"},
{"term":"Management","abbreviation":"","definition":"Control activity in a construction process by one or more construction agents","references":"ISO 12911"},
{"term":"Management of Assets","abbreviation":"","definition":"Operational activities carried out on assets in support of those assets meeting their requirements","references":"PAS1192-3"},
{"term":"Manufacturer's Model of Physical Object Relation","abbreviation":"","definition":"Special kind of qualification relation that relates two concepts whereby the subtype is a manufacturer's model of a kind of physical object and the supertype is concept that is a kind of physical object R1 role player: physical object R2 role player: physical object/R1 role: manufacturer's model R2 role: nature/R1-R2 expression: is a model of R2-R1 expression: is the nature of model","references":"ISO 16354"},
{"term":"Marked-up Drawing","abbreviation":"","definition":"Paper or electronic drawing that has been marked up with comments from other disciplines or the client","references":"PAS1192-2 Back"},
{"term":"Master Information Delivery Plan","abbreviation":"MIDP","definition":"Primary plan for when project information is to be prepared, by whom and using what protocols and procedures, incorporating all relevant task information delivery plans (TIDPs).","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Master Information Document Index","abbreviation":"MIDI","definition":"Index specifying a detailed list of the deliverables for a project; for model, sub models, documents and data also allocating responsibility to deliver and the programme for delivery of a project supply chain","references":"PAS1192-2 Back"},
{"term":"Measure","abbreviation":"","definition":"Quantitative or qualitative assessment of relative achievement of a desired quality characteristic","references":"ISO 12911"},
{"term":"Meta-data","abbreviation":"","definition":"Data used for the description and management of documents and other containers of information","references":"BS1192"},
{"term":"Metrics","abbreviation":"","definition":"The acceptability of the deliverable may be assessed against the requirements shown in the examples and/or against indicative ratios and counts based on the information provided","references":"PAS1192-2 Back"},
{"term":"Minor Works","abbreviation":"","definition":"Works carried out on an asset where information is managed using this PAS","references":"PAS1192-3"},
{"term":"Model","abbreviation":"","definition":"Representation of a system that allows for investigation of the properties of the system","references":"ISO/DIS 29481, BS1192"},
{"term":"Model File","abbreviation":"","definition":"Native, proprietary format, CAD file that can be a 2D or 3D model","references":"PAS1192-2 Back"},
{"term":"Model View Definition","abbreviation":"MVD","definition":"A computer-interpretable definition of an exchange requirement, specifically bound to one or more particular standard information schemas","references":"ISO/DIS 29481-1"},
{"term":"Naming Relation","abbreviation":"","definition":"Relation that relates a term with something (UID) that is denoted by the term R1 role player: term R2 role player: anything/R1 role: name R2 role: named/R1-R2 expression: is a name for R2-R1 expression: has as name","references":"ISO 16354"},
{"term":"Natural Environment","abbreviation":"","definition":"Non-artificial environment of any physical construction object","references":"ISO 12006"},
{"term":"Need-to-know","abbreviation":"","definition":"grant of access to data or information relating to sensitive assets and systems for an individual or organization where such access must be necessary in order for them to perform their role satisfactorily and safely","references":"PAS1192-5"},
{"term":"Neighbouring built assets","abbreviation":"","definition":"built assets that share a boundary (including beneath it or overhead) with the built asset under consideration, or that are in the neighbourhood of that built asset but physically separated by a public or private street, public or privately-owned open space or similar features","references":"PAS1192-5"},
{"term":"New Rules of Measurements","abbreviation":"NRM","definition":"RICS New Rules of Measurement (NRM) for Building Works: a suite of documents issued by the RICS Quantity Surveying and Construction Professional Group","references":"PAS1192-2 Back"},
{"term":"New Rules of Measurements 1","abbreviation":"NRM1","definition":"Order of Cost Estimating and Cost Planning for Capital Building Works","references":"PAS1192-2 Back"},
{"term":"New Rules of Measurements 2","abbreviation":"NRM2","definition":"Detailed measurement for building works, provides detailed rules for the measurement and description of building works for the purpose of obtaining tender prices","references":"PAS1192-2 Back"},
{"term":"New Rules of Measurements 3","abbreviation":"NRM3","definition":"Order of cost estimating and cost planning for building maintenance works is currently in development and is expected to launch in 2013","references":"PAS1192-2 Back"},
{"term":"Non-graphical Data","abbreviation":"","definition":"Data conveyed using alphanumeric characters","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Object","abbreviation":"","definition":"Item having state, behaviour and unique identity ? for example, a wall object","references":"ISD 12911, ISO 15686-4, ISD/DIS 29481-1, PAS1192-2 Back"},
{"term":"Objective","abbreviation":"","definition":"Role of a state that is intended to be achieved or that is intended to be prevented","references":"ISO 12911, ISO 16354"},
{"term":"Occupant","abbreviation":"","definition":"user who spends a significant proportion of their time in or about a facility","references":"BS8636-1"},
{"term":"Occurance","abbreviation":"","definition":"State that is dynamic and is an interaction over time between involved things, each with its own role","references":"ISO 16354"},
{"term":"Occurance Object","abbreviation":"","definition":"Representation of an actual occurrence (instance) of an object in a building","references":"BS 8541-1, BS 8541-3, BS 8541-4"},
{"term":"Operability","abbreviation":"","definition":"capable of being put into use as intended","references":"BS8636-1"},
{"term":"Operation Information","abbreviation":"","definition":"Information specifying operational activity associated to Types","references":"BS1192-4"},
{"term":"Operational Strategy","abbreviation":"","definition":"overall approach to managing the production or use of an asset/facility","references":"BS8636-1"},
{"term":"Operationis team","abbreviation":"","definition":"functional group responsible for the day-to-day running and maintenance of an asset/facility","references":"BS8636-1"},
{"term":"Operator","abbreviation":"","definition":"Organization that uses an asset to create value but does not own the asset","references":"PAS1192-3"},
{"term":"Organization","abbreviation":"","definition":"Group of people and facilities with an arrangement of responsibilities, authorities and relationships","references":"PAS1192-3, PAS1192-5"},
{"term":"Organization Information Requirements","abbreviation":"OIR","definition":"Data and information required to achieve the organization?s objectives","references":"PAS1192-3, BS8636-1"},
{"term":"Origin","abbreviation":"","definition":"As the setting out point for a project or programme using co-ordinate geometry or related to the OS or geospatial reference","references":"PAS1192-2 Back"},
{"term":"Originator","abbreviation":"","definition":"Agent responsible for production of a container","references":"BS1192, PAS1192-2 Back"},
{"term":"Owner","abbreviation":"","definition":"Organization that owns an asset and uses the asset either directly or indirectly to create value","references":"PAS1192-3"},
{"term":"Parametrizable Primitive Solid","abbreviation":"","definition":"Model of a defined primitive solid, e.g. a block, cylinder, sphere or cone whose dimensions are represented by parameters to generate variants","references":"ISO/DSI 16757-2"},
{"term":"Part-of Relation","abbreviation":"","definition":"Relation between two construction objects where one object constitutes the whole and the other a part of that whole","references":"ISO 12006"},
{"term":"Performance","abbreviation":"","definition":"ability to fulfil required functions under intended use conditions or behaviour when in use","references":"BS8636-1, ISO 15392"},
{"term":"Personally Identifiable Information","abbreviation":"","definition":"Personal data as defined in the Data Protection Act 1998","references":"PAS1192-5"},
{"term":"Personnel","abbreviation":"","definition":"Individuals employed by an organization, including contractors or temporary staff used to fulfil roles that may be undertaken by that organization","references":"PAS1192-5"},
{"term":"Physical Object","abbreviation":"","definition":"Individual thing that has a physical nature with a limited lifespan; it may be materialized (and then it may be observable and touchable) or it may be imagined (having deemed aspects, as-if observable)","references":"ISO 16354"},
{"term":"Physical Object - Aspect Relation","abbreviation":"","definition":"Relation between a kind of physical object and a kind of aspect that specifies that the physical objects of the specified kind can have or has by definition an aspect of the specified kind R1 role player: physical object R2 role player: aspect/R1 role: possessor R2 role: possessed/R1-R2 expression: can have as aspect a R2-R1 expression: can be an aspect of a","references":"ISO 16354"},
{"term":"Placeholder","abbreviation":"","definition":"Simplified or generic representation of a 3D object","references":"PAS1192-2 Back"},
{"term":"Plain Language Questions","abbreviation":"PLQ","definition":"Questions asked of the supply chain by the employer to inform decision-making at key stages of an asset life cycle or project","references":"PAS1192-3"},
{"term":"Platfrom as a Serivce","abbreviation":"PAAS","definition":"","references":"OBE"},
{"term":"Port","abbreviation":"","definition":"Located, oriented and directed feature of the product's geometry model for connecting the product to transfer media, fastening other products or executing treatment","references":"ISO/DSI 16757-2"},
{"term":"Portable Document Format (File Format)","abbreviation":"PDF","definition":"Portable Document Format. A standard document format from Adobe Systems for transfer between different computer systems","references":"PAS1192-2 Back"},
{"term":"Post-occupancy Evaluation","abbreviation":"POE","definition":"process of evaluating an asset/facility after it has been completed and is in use to understand its actual performance against that required and to capture lessons learned","references":"BS8636-1"},
{"term":"Pre-design Process","abbreviation":"","definition":"Construction process determining construction properties for the built environment before it is designed","references":"ISO 12006-2"},
{"term":"Procedure","abbreviation":"","definition":"Specified way to carry out an activity or a process","references":"ISO 22263"},
{"term":"Process","abbreviation":"","definition":"Set of interrelated or interacting activities which transforms inputs and outputs","references":"ISO22263"},
{"term":"Process Map","abbreviation":"PM","definition":"Representation of the relevant characteristics of a process associated with a defined business purpose","references":"ISO/DSI 29481-1"},
{"term":"Procurement (Construction Related)","abbreviation":"","definition":"commissioning of goods, works and services in relation to a construction related project","references":"PAS 91"},
{"term":"Product","abbreviation":"","definition":"Orderable, technical entity","references":"ISO/DSI 16757-1"},
{"term":"Product Catalouge","abbreviation":"","definition":"Compilation of information about products","references":"ISO/DSI 16757-1"},
{"term":"Product Delcaration","abbreviation":"","definition":"Data related to a product provided or verified by a distinct independent declaration scheme to support specification and selection","references":"BS 8541-6"},
{"term":"Product Group","abbreviation":"","definition":"Set of products described by common properties","references":"ISO/DSI 16757-1"},
{"term":"Product Index","abbreviation":"","definition":"Compilation of references to all property values of a defined product, the product description, the product geometry, and the product article numbers","references":"ISO/DSI 16757-1"},
{"term":"Product Object","abbreviation":"","definition":"Type object intended to represent an obtainable product, either as a requirement or exemplar or as-built","references":"BS 8541-1, BS 8541-3, BS 8541-4"},
{"term":"Product Series","abbreviation":"","definition":"Types of products, defined by the manufacturer, which are commonly constructed and manufactured","references":"ISO/DSI 16757-1"},
{"term":"Product Shape","abbreviation":"","definition":"Geometric representation of the space defined by the product's external boundaries","references":"ISO/DSI 16757-2"},
{"term":"Product Surface","abbreviation":"","definition":"Coloured and textured outer boundary of the product's shape whose rendered appearance responds to the relative lighting and viewing angles","references":"ISO/DSI 16757-2"},
{"term":"Production Process","abbreviation":"","definition":"Construction process resulting in built environment","references":"BSI 12006-2"},
{"term":"Project","abbreviation":"","definition":"Unique process consisting of a set of coordinated and controlled activities with start and finish dates, undertaken to achieve an objective conforming to specific requirements, including the constraints of time, cost and resources to effect change to the physical or operational aspects of a facility","references":"ISO 12911, ISO 22263"},
{"term":"Project Delivery Team","abbreviation":"","definition":"group of organizations or individuals contracted either directly or indirectly to deliver services or products to the project, and personnel from the employer or asset owner who are directly involved in the management, planning and delivery of the project","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-5"},
{"term":"Project Execution Plan","abbreviation":"","definition":"high-level statement of the intentions and arrangements for a project","references":"BS8636-1"},
{"term":"Project Implementation Plan","abbreviation":"PIP","definition":"Statement relating to the suppliers? IT and human resources capability to deliver the EIR","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Project Information Model","abbreviation":"PIM","definition":"Information model developed during the design and production and construction phase of a project, consisting of graphical information, non- graphical information and documentation defining the delivered project","references":"PAS1192-2 Front, PAS1192-2 Back, PAS1192-3, BS8636-1"},
{"term":"Promoter","abbreviation":"","definition":"Algorithm that generates an interaction schema for an interaction framework, interaction framework schema, and templates file for input","references":"ISO/DSI 29481-2"},
{"term":"Property","abbreviation":"","definition":"Defined parameter suitable for the description and differentiation of products","references":"ISO/DSI 16757-1"},
{"term":"Property Set","abbreviation":"","definition":"Grouping of properties that belong together based on some principle, e.g. viewpoint, lifecycle stage","references":"ISO 15686"},
{"term":"Published/Documentation","abbreviation":"","definition":"Component of the CDE for drawing renditions that have been approved as suitable for a specific purpose - for example, suitable for construction","references":"BS1192-2 Back"},
{"term":"Purpose of Issue","abbreviation":"","definition":"States the purpose for issuing the document","references":"BS1192-2 Back"},
{"term":"Purposes","abbreviation":"","definition":"Those aspects of the Facility that are intended to be managed by the facility owner","references":"BS1192-2 Back"},
{"term":"Qualification Relation","abbreviation":"","definition":"Kind of specialization relation that relates two concepts whereby the subtype is a qualitative concept and the supertype is a conceptual concept R1 role player: qualitative concept R2 role player conceptual concept/R1 role: qualifier R2 role: nature/R1-R2 expression: is a qualification of R2-R1 expression: is the nature of","references":"ISO 16354"},
{"term":"Quality","abbreviation":"","definition":"Degree to which a set of inherent characteristics fulfils requirements","references":"ISO 22263, BS8536-1, ISO 9001"},
{"term":"Quantity Set","abbreviation":"","definition":"Grouping of characteristic measure properties","references":"ISO 15686-4"},
{"term":"RACI Indicator","abbreviation":"","definition":"Abbreviation used to identify which of a group of participants or stakeholders are responsible for ('R'), authorize ('A'), contribute to ('C') or are to be kept informed about ('I') a project activity","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"RAG Report","abbreviation":"","definition":"performance report summarizing a series of assessments as red (does not meet requirement), amber (does not meet requirement but plan in place to bring up to standard), or green (meets requirement)","references":"PAS1192-3"},
{"term":"Record","abbreviation":"","definition":"Document stating results achieved or providing evidence of activities performed","references":"ISO 22263"},
{"term":"Red Amber Green","abbreviation":"RAG","definition":"","references":""},
{"term":"Reference File","abbreviation":"","definition":"CAD model file associated or linked with another CAD model file. Also referred to as an 'X-ref'","references":"PAS1192-2 Back"},
{"term":"Relation","abbreviation":"","definition":"Concept that expresses a fact or opinion about a fact by specifying the things that are involved in the fact and the roles that the various involved things play in the fact","references":"ISO 16354"},
{"term":"Relation Between an Individual Thing and a Kind of Thing","abbreviation":"","definition":"","references":"ISO 16354"},
{"term":"Relation Between Kinds of Things","abbreviation":"","definition":"Relation that specifies knowledge or requirements or permissions in general terms about what can be the case, shall be the case, is allowed to be the case or is by definition the case","references":"ISO 16354"},
{"term":"Rendition","abbreviation":"","definition":"Documentation in a form enabling the information to be viewed, printed and marked up. For example, PDF and DWF fi les are documentation consisting of snapshots of","references":"PAS1192-2 Back"},
{"term":"Representation","abbreviation":"","definition":"scale view of an object","references":"BS 8541-2"},
{"term":"Representation Object","abbreviation":"","definition":"Object that represents a product or a part of it as a whole","references":"ISO/DSI 16757-1"},
{"term":"Requirements","abbreviation":"","definition":"Requirements are the documented expectations of facility owners/commissioners for sharable structured information. These are also referred to as the Employers Information Requirements (EIR) ","references":"PAS1192-2 Back"},
{"term":"Resource","abbreviation":"","definition":"Named material or skill required to execute Jobs","references":""},
{"term":"Review","abbreviation":"","definition":"Activity undertaken to determine the suitability, adequacy and effectiveness of the subject matter to achieve established objectives","references":""},
{"term":"Revision","abbreviation":"","definition":"Used to identify revisions of documents, drawing and model files","references":"PAS1192-2 Back"},
{"term":"Risk Appetite","abbreviation":"","definition":"Function of an organization's capacity to bear risk","references":"PAS1192-5"},
{"term":"Role","abbreviation":"","definition":"Functions being performed by an actor at a point in time","references":"ISO 16354"},
{"term":"Role of a Physical Object","abbreviation":"","definition":"Role that a physical object plays in a relationship or the contribution that a physical object delivers in an occurrence","references":"ISO 16354"},
{"term":"Scale","abbreviation":"","definition":"Kind of relation that is used to classify relations between physical properties and numbers, thus indicating a method for quantifying sizes or extents of aspects by mathematical values or ranges","references":"ISO 16354"},
{"term":"Scope of Work","abbreviation":"","definition":"design, construction work and/or installation, testing and commissioning, handover and start-up activities necessary to deliver an operational asset/facility","references":"BS8636-1"},
{"term":"Security Management","abbreviation":"","definition":"Role in connection with the project or the management of the asset which is responsible for security of the built asset and associated asset information during the design, construction, operation and maintenance, and disposal or decommissioning of a built asset","references":"PAS1192-5"},
{"term":"Security-minded","abbreviation":"","definition":"Understanding and routine application of appropriate and proportionate security measures in any business situation so as to deter and/or disrupt hostile, malicious, fraudulent and criminal behaviours or activities","references":"PAS1192-5"},
{"term":"Sensitive Built Asset","abbreviation":"","definition":"Built asset, as a whole or in part, that may be of interest to a threat agent for hostile, malicious, fraudulent and/or criminal behaviours or activates","references":"PAS1192-5"},
{"term":"Sensitive Information","abbreviation":"","definition":"Information, the loss, misuse or modification of which, or unauthorized access to, could: adversely affect the privacy, welfare or safety of an individual or individuals; compromise intellectual property or trade secrets of an organization; cause commercial or economic harm to an organization or country; and/or jeopardize the security, internal and foreign affairs of a nation, depending on the level of sensitivity and nature of the information","references":"PAS1192-5"},
{"term":"Shared","abbreviation":"","definition":"Component of the CDE. The shared section of the CDE is where information can be made available to others in a 'safe' environment. The early release of information assists in the rapid development of the design solution. To allow this to be achieved, the concept of information 'status/suitability' has been adopted","references":"PAS1192-2"},
{"term":"SI System","abbreviation":"","definition":"Le Systï¿½me International d?Unitï¿½s. International system of units","references":"PAS1192-2"},
{"term":"Simplified Representation","abbreviation":"","definition":"scale view incorporating only the essential shape, size or features of an object","references":"BS 8541-2"},
{"term":"Smart","abbreviation":"","definition":"Application of autonomous or semi-autonomous technology systems to achieve greater utilization of resources, limiting or reducing per capita resource consumption to maintain or improve quality of life","references":"PAS1192-5"},
{"term":"Smart City","abbreviation":"","definition":"Effective integration of physical, digital and human systems in the built environment to deliver a sustainable, prosperous and inclusive future for its citizens","references":"PAS1192-5"},
{"term":"Smart Grid","abbreviation":"","definition":"Electricity network that uses information and communications technology (ICT) to integrate the actions of all users connected to it ? generators, consumers and those that do both ? in order to efficiently deliver sustainable, economic and secure electricity supplies","references":"PAS1192-5"},
{"term":"Soft Landings","abbreviation":"","definition":"Process for the graduated handover of a new or refurbished asset/facility, where a defined period of aftercare by the design","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Solid Modelling","abbreviation":"","definition":"Method to describe shapes and surfaces by a computer model by joining solid primitives","references":"ISO/DSI 16757-2"},
{"term":"Space","abbreviation":"","definition":"Limited three-dimensional extent defined physically or notionally","references":"ISO 12006-2"},
{"term":"Space (Location)","abbreviation":"","definition":"Named location for activities such as use, inspection or maintenance, including un?occupied or un?inhabitable Spaces, but not necessarily inaccessible voids","references":"BS1192-4"},
{"term":"Spare","abbreviation":"","definition":"named replaceable part associated to Types","references":"BS1192-4"},
{"term":"Specialization Relation","abbreviation":"","definition":"Relation between kinds of things that relates two concepts whereby the subtype concept is a more specific concept than the supertype concept and has all the aspects that define the supertype concept R1 role player: concept/ R2 role player: concept R1 role: subtype/R2 role:supertype R2 expression/R2-R1 expression is a specialization of/is a generalization of","references":"ISO 16354"},
{"term":"Specification","abbreviation":"","definition":"Document stating requirements","references":"ISO 22263, BS 8541-4"},
{"term":"Stage","abbreviation":"","definition":"division of a standardized process map for the acquisition of a facility, at some of which the requirements can be delivered","references":"BS8636-1"},
{"term":"Stakeholder","abbreviation":"","definition":"person, group or organization that has interests in, or can affect, be affected by or perceive itself to be affected by, any aspect of the project","references":"BS8636-1, ISO 21500"},
{"term":"Standard Font","abbreviation":"","definition":"Agreed set of font types and sizes to be used for the project","references":"PAS1192-2 Back"},
{"term":"Standard Layering Convention","abbreviation":"","definition":"Single layering convention used by the project team","references":"PAS1192-2 Back"},
{"term":"Standard Method and Procedure","abbreviation":"SMP","definition":"Set of standard methods and procedures covering the way information is named, expressed and referenced","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Static Property","abbreviation":"","definition":"Technical property that is independent of the operating conditions of the building services system in which the product is installed and which gets its fixed value from the catalogue","references":"ISO/DSI 16757-1"},
{"term":"Status","abbreviation":"","definition":"Defines the 'suitability' of information in a model drawing or document. Not to be confused with the status in architectural documentation as 'new build?, 'retain' or 'demolish'","references":"PAS1192-2 Back"},
{"term":"Sub-consultant","abbreviation":"","definition":"Entity engaged on consultancy work, directly under the control of a consultant","references":"PAS 91"},
{"term":"Sub-contractor","abbreviation":"","definition":"Entity engaged to undertake work for a contractor as part of a larger project being undertaken by that second entity","references":"PAS 91"},
{"term":"Sub-Model","abbreviation":"","definition":"model included as an instance in another model","references":"BS1192"},
{"term":"Supplier","abbreviation":"","definition":"Provider of services or goods either directly to the employer or to another supplier in a supply chain","references":"PAS1192-2 Front, PAS1192-2 Back, PAS 91"},
{"term":"Supplier Information Modelling Assessment Form","abbreviation":"","definition":"The form conveying the capability and experience of a supplier to carry out information modelling in a collaborative environment","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Supplier Information Technology Assessment Form","abbreviation":"","definition":"The form conveying the capability and IT resources of a supplier for exchanging information in a collaborative environment","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Supplmentary Information","abbreviation":"","definition":"additional descriptive information associated to the assets","references":"BS1192-4"},
{"term":"Supply Chain","abbreviation":"","definition":"sequence of all entities engaged directly or indirectly by a client to contribute goods, works and services to a construction related project","references":"PAS 91"},
{"term":"Supply Chain Capability Assessment Form","abbreviation":"","definition":"Form summarizing the human resource and IT capability of each organization in a supply chain","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Symbol","abbreviation":"","definition":"graphic device without scale used: a) on a drawing to indicate the occurrence and/or location of an item; b) in an annotation to indicate one or more of the attributes of an item","references":"BS 8541-2"},
{"term":"Symbol Element (Element)","abbreviation":"","definition":"Graphic device without scale used only in combination with a symbol (or symbols) or with other elements, to form a symbol","references":"BS 8541-2"},
{"term":"Synonym Relation","abbreviation":"","definition":"Relation between two naming relations that relates an object with a particular name in one context with the same object with another (or the same) name in another context in the same language R1 role player: naming relation R2 role player: naming relation/R1 role: synonym R2 role: base/ R1-R2 expression: is s synonym of, is an abbreviation of R2-R1 expression: is a synonym for, is abbreviated by","references":"ISO 16354"},
{"term":"System","abbreviation":"","definition":"named set of manageable Components providing a common function","references":"PAS1192-2 Back"},
{"term":"System (IFC)","abbreviation":"","definition":"Organized combination of related parts, composed for a common purpose or function or to provide a service. System is essentially a functionally related aggregation of products","references":"PAS1192-2 Back"},
{"term":"System Engineering","abbreviation":"","definition":"Interdisciplinary approach enabling the realization of successful systems","references":"PAS1192-2 Back"},
{"term":"Task","abbreviation":"","definition":"Set of activities normally under the responsibility of one agent","references":"ISO 22263"},
{"term":"Task Information Delivery Plan","abbreviation":"TIDP","definition":"Federated lists of information deliverables by each task, including format, date and responsibilities","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Technical Property","abbreviation":"","definition":"Property which is used to represent technical data and functions for designing, calculating, and simulating the product","references":"ISO/DSI 16757-1"},
{"term":"Template Object","abbreviation":"","definition":"Type object intended to guide the production of generic objects and product objects by providing schedules of classification values and a minimum set of attributes","references":"BS 8541-1, BS 8541-3, BS 8541-4"},
{"term":"Templates File","abbreviation":"","definition":"File containing a number of templates, independent of the interaction framework, for generating an interaction schema","references":"ISO/DSI 29481-1"},
{"term":"Term","abbreviation":"","definition":"(1)verbal designation of a concept or individual thing in a specific subject field (adapted from ISO 1087-1:2000) (2)role of a physical character string or sound that may include spaces and silences, respectively, that is used to designate a concept (e.g. a kind of physical object or aspect) or to designate an individual thing in a particular language (coding system) and language community","references":"ISO 16354"},
{"term":"Tester","abbreviation":"","definition":"testing body","references":"BS 8541-6"},
{"term":"Third Party Capability Assessment Form","abbreviation":"","definition":"Form conveying the information management and IT capabilities of non-design, non-construction organizations in a supply chain","references":"PAS1192-2 Front"},
{"term":"Threat","abbreviation":"","definition":"Potential cause of an incident which may result in harm to a system or organization","references":"PAS1192-5"},
{"term":"Traceability","abbreviation":"","definition":"Ability to trace the history, application or location of that which is under consideration","references":"ISO 22263"},
{"term":"Transaction","abbreviation":"","definition":"A communication event that fulfils a relationship between two roles","references":"ISO/DSI 29481-1"},
{"term":"Transaction Map","abbreviation":"","definition":"Representation of a set of messages that are exchanged between participating roles for a particular purpose","references":"ISO/DSI 29481-1"},
{"term":"Transaction Relation","abbreviation":"","definition":"Relation between two naming relations that relates an object with a particular name in one language with the same object with another (or the same) name in another language R1 role player: naming relation R2 naming relation/R1 role: translation R2 role: base/R1-R2 expression: is a translation of R2-R1 expression: is translated by","references":"ISO 16354"},
{"term":"Trigger","abbreviation":"","definition":"Planned or unplanned event that changes an asset or its status","references":"PAS1192-3"},
{"term":"Trigger-related Event","abbreviation":"","definition":"Response to a trigger and the reflection of the altered state of the asset in the AIM","references":"PAS1192-3"},
{"term":"Type","abbreviation":"","definition":"named specification for Components including equipment, products and materials","references":"BS1192-4"},
{"term":"Type (Library) Object","abbreviation":"","definition":"Representation of the common features of a product or group, including its classifications and properties","references":"BS 8541-1, BS 8541-3, BS 8541-4"},
{"term":"Type-of Relation","abbreviation":"","definition":"Relation between two concepts where the intention of one of the concepts includes that of the other concept and at least one additional delimiting characteristic","references":"ISO 12006"},
{"term":"Uniclass","abbreviation":"","definition":"Unified classifications for the construction industry sponsored by CC, RICS, RIBA and CIBSE. The classification system is based on CI/SfB, CAWS and other relevant documents. Complying with BS ISO 12006-2","references":"PAS1192-2 Back"},
{"term":"Unique Identifier","abbreviation":"UID","definition":"Role of a character string when used for unambiguous reference to a concept or to an individual thing (e.g. a physical object or an aspect or a fact or a relation type) and that is unique within a particular common context, preferably in a universal context","references":"ISO 16354"},
{"term":"Unit of Measure","abbreviation":"","definition":"Scale that specifies how the size or extent of an aspect is unambiguously quantified by a value on a mathematical range","references":"ISO 16354"},
{"term":"User","abbreviation":"","definition":"Individual occupying or using a built asset for its design purpose","references":"PAS1192-2 Front, PAS1192-2 Back"},
{"term":"Utilization Ratio","abbreviation":"","definition":"Proportion of time that the facility or the product is expected to be fully utilized","references":"ISO 15686-4"},
{"term":"Validation","abbreviation":"","definition":"Confirmation, through the provision of objective evidence, that the rquirements for a specific intended use or application have been fulfilled","references":"ISO 22263"},
{"term":"Verification","abbreviation":"","definition":"confirmation, through the provision of objective evidence, that specified requirements have been fulfilled","references":"ISO 22263"},
{"term":"Version","abbreviation":"","definition":"Sub-indexing to revision as used in the common data environment to show the development of information and information models, e.g. if a version is named P1.1, P1 is the revision number and .1 is the version to that revision","references":"PAS1192-2 Back"},
{"term":"Virtual Construction Model","abbreviation":"","definition":"Subsequent version of the Project Information Model developed from the design intent model by the construction supplier and their supply chain","references":"PAS1192-2 Front, PAS1192-2 Front"},
{"term":"Volume","abbreviation":"","definition":"Manageable spatial subdivision of a project, defined by the 'project team' as a subdivision of the overall project that allows more than one person to work on the project models simultaneously and consistent with the analysis and design process","references":"PAS1192-2 Front, PAS1192-2 Front"},
{"term":"Voorwaarden Scheppen Voor Invoeren Standaardisatie ICT in de Infrastructure-sector","abbreviation":"VISI","definition":"Acronym for Dutch standard for communication between partners in construction projects","references":"ISO/DSI 29481-1"},
{"term":"Vulnerability","abbreviation":"","definition":"weakness of an asset or group of assets that can be exploited by one or more threats","references":"PAS1192-5"},
{"term":"Work in Progress","abbreviation":"WIP","definition":"Component of the CDE","references":"PAS1192-2 Back"},
{"term":"Work Result","abbreviation":"","definition":"View of construction result by type of work activity and resources used","references":"ISO 12006"},
{"term":"X-Ref","abbreviation":"","definition":"CAD model file associated or linked with another CAD model file. Also referred to as a 'reference file'","references":"PAS1192-2 Back"},
{"term":"Zone","abbreviation":"","definition":"named set of Spaces (locations) sharing a specific Attribute, such as activity, access, management or conditioning","references":"BS1192-4"}
]
